app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "testsetasdfa "], ["user_id", 1], ["created_at", "2019-10-13 14:54:49.975938"], ["updated_at", "2019-10-13 14:54:49.975938"]]
---
    def create
        @micropost = current_user.microposts.build(micropost_params)
        if @micropost.save