app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
    def index
       # @users = User.all
       @users = User.paginate(page: params[:page])